dictionaries?

* we will try to create a dictionary
* data types with keys and values

In [1]:
#create a small dictionary
#names of 4 students, and their marks

#key : value

students = {
    "Linda":88,
    "Mel":96,
    "Tun":88,
    "Lina":89
}

print(students)

#access elements
students["Mel"]

{'Linda': 88, 'Mel': 96, 'Tun': 88, 'Lina': 89}

96

In [2]:
students_grades ={
    "name":["Linda","Mel","Lina","Alin"],
    "maths":[90,92,95,94],
    "english":[95,90,91,92],
    "science":[92,97,95,94]
}

print(students_grades)

{'name': ['Linda', 'Mel', 'Lina', 'Alin'], 'maths': [90, 92, 95, 94], 'english': [95, 90, 91, 92], 'science': [92, 97, 95, 94]}

In [3]:
students_grades["name"]
students_grades["name"][0]

'Linda'

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\hanim\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

pd.DataFrame(students_grades)

    name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

In [6]:
df = pd.DataFrame(students_grades)

df
print("\n first table-----------\n",df)
print("\n second table-----------\n",df)
print("\n third table-----------\n",df)

 first table-----------
     name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

 second table-----------
     name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

 third table-----------
     name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

In [7]:
type(df)

#numpy.narray

pandas.core.frame.DataFrame

In [8]:
df.head() #top part of a df is the default argument

df.tail()

    name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

In [9]:
# we can access certain columns  in dataframes too

df["maths"]

0    90
1    92
2    95
3    94
Name: maths, dtype: int64

In [10]:
print ("\n Names column -----------\n", df ["name"])
print ("\n Maths column -----------\n", df ["maths"])
print ("\n English column -----------\n", df ["english"])
print ("\n Science column -----------\n", df ["science"])

 Names column -----------
 0    Linda
1      Mel
2     Lina
3     Alin
Name: name, dtype: object

 Maths column -----------
 0    90
1    92
2    95
3    94
Name: maths, dtype: int64

 English column -----------
 0    95
1    90
2    91
3    92
Name: english, dtype: int64

 Science column -----------
 0    92
1    97
2    95
3    94
Name: science, dtype: int64

In [11]:
import numpy as np
arrayyyy = np.array([])
type(arrayyyy)

numpy.ndarray

In [12]:
#series

marks_series = pd.Series([1,2,3])
#type(marks_series)

print(marks_series)

0    1
1    2
2    3
dtype: int64

In [13]:
df

    name  maths  english  science
0  Linda     90       95       92
1    Mel     92       90       97
2   Lina     95       91       95
3   Alin     94       92       94

In [15]:
#how many marks does Lina have in English?

english_lina = df["english"] [2]
print("In english Lina had 91 marks")


#-------"in English Mel had 90 marks"
#type(english)

mel=df["name"][1]
mel_english=df["maths"][1]

print(f" In Maths {mel} had {mel_maths} marks")

In english Lina had 91 marks

NameError: name 'mel_maths' is not defined

In [16]:
print('Marks Lina for subject English is \t',df.english[3])
 
print('Marks Lina for subject English is \t',df.english[3])

Marks Lina for subject English is 	 92
Marks Lina for subject English is 	 92

In [17]:
print(f'In English {df.name[3]} had {df.english[3]} marks')

In English Alin had 92 marks

# core data types we use in pandas?
#dataframe
#series

In [18]:
## Create a series data pd.series 5 values of temperature

## Create A Dataframe city and temperature - 5 cities

In [19]:
temp_series = pd.Series([35,37,38,36,37])
#type(temp_series)

print(temp_series)

0    35
1    37
2    38
3    36
4    37
dtype: int64

In [20]:
City_Temp ={
    "City":["Seremban","Ipoh", "JB","Kuantan"],
    "Temp":[28,30,29,30]
    }
df=pd.DataFrame(City_Temp)
print(df)

       City  Temp
0  Seremban    28
1      Ipoh    30
2        JB    29
3   Kuantan    30

In [21]:
temp_df #dataframe object
temp11

NameError: name 'temp_df' is not defined

In [22]:
temp11 =pd.Series([32,31,50,34,-2])
print("type of temp11:",type(temp11))

#a dictionary of temeperatues
#python data object

temperatures = {
    "cities": ["KL","HK","SG","NY","HLS"],
    "Temp10": [23,29,40,0,5]
}

temp_df = pd.DataFrame(temperatures)
print("type of temp_df:",type(temp_df))

print(temp_df)
print(temp11)

type of temp11: <class 'pandas.core.series.Series'>
type of temp_df: <class 'pandas.core.frame.DataFrame'>
  cities  Temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [23]:
# dataFrame create a column that does not exist
temp_df["temp11"]= temp11
temp_df

  cities  Temp10  temp11
0     KL      23      32
1     HK      29      31
2     SG      40      50
3     NY       0      34
4    HLS       5      -2

In [24]:
#series object - single column, ID columns

temp11 =pd.Series([32,31,50,34,-2])
print("type of temp11:",type(temp11))

#a dictionary of temperature
#python data object

temperatures = {
    "cities": ["KL","HK","SG","NY","HLS"],
    "Temp10": [23,29,40,0,5]
}

#creating a dataframe
#dataframe is a pandas
temp_df = pd.DataFrame(temperatures)
print("type of temp_df:",type(temp_df))

print(temp_df)
print(temp11)

#temp_df ----> add day11 to this as well

type of temp11: <class 'pandas.core.series.Series'>
type of temp_df: <class 'pandas.core.frame.DataFrame'>
  cities  Temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [25]:
type(temp_df[cities])

NameError: name 'cities' is not defined

In [26]:
print(temp_df)
print(temp11)

  cities  Temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [27]:
temp_df [cities] = {}
temp_df

NameError: name 'cities' is not defined

In [28]:
# dataFrame create a column that does not exist
temp_df["temp11"]= temp11
temp_df

  cities  Temp10  temp11
0     KL      23      32
1     HK      29      31
2     SG      40      50
3     NY       0      34
4    HLS       5      -2

In [29]:
temp_df["empty_temp"] = {}
temp_df

  cities  Temp10  temp11 empty_temp
0     KL      23      32        NaN
1     HK      29      31        NaN
2     SG      40      50        NaN
3     NY       0      34        NaN
4    HLS       5      -2        NaN

In [30]:
temp_df["linaRating"] = {}
temp_df

  cities  Temp10  temp11 empty_temp linaRating
0     KL      23      32        NaN        NaN
1     HK      29      31        NaN        NaN
2     SG      40      50        NaN        NaN
3     NY       0      34        NaN        NaN
4    HLS       5      -2        NaN        NaN

In [31]:
temp_df["lindaRating"] = {}
temp_df

  cities  Temp10  temp11 empty_temp linaRating lindaRating
0     KL      23      32        NaN        NaN         NaN
1     HK      29      31        NaN        NaN         NaN
2     SG      40      50        NaN        NaN         NaN
3     NY       0      34        NaN        NaN         NaN
4    HLS       5      -2        NaN        NaN         NaN

In [32]:
temp_df["melRating"] = {}
temp_df

  cities  Temp10  temp11 empty_temp linaRating lindaRating melRating
0     KL      23      32        NaN        NaN         NaN       NaN
1     HK      29      31        NaN        NaN         NaN       NaN
2     SG      40      50        NaN        NaN         NaN       NaN
3     NY       0      34        NaN        NaN         NaN       NaN
4    HLS       5      -2        NaN        NaN         NaN       NaN

In [33]:
temp_df["LindaRating"] = pd.Series ([5,4,1,5,2])

In [34]:
temp_df["melRating"] = pd.Series([-1,5,4,2,3])
temp_df["linaRating"] = pd.Series([5,3,3,3,3])

In [35]:
df=temp_df

In [36]:
#already a dataset?
#save this as csv file??

temp_df.to_csv("City Rating without Row Numbers.csv",index=False)

In [37]:
data = {
    "cities" : ["KL","KL","KL","NY","HLS"],
    "temp10" : [23,29,40,0,5]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [38]:
df["cities"].value_counts()

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [39]:
df["cities"].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [40]:
df ["cities"].duplicates()

AttributeError: 'Series' object has no attribute 'duplicates'

In [41]:
df2 = df["cities"].drop_duplicates()
df2

0     KL
3     NY
4    HLS
Name: cities, dtype: object

In [43]:
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [44]:
df.to_csv("cities_temps.csv")